# Groupby : Split, Apply and Combine
---------------
   Groupby is one of the important operations in data analysis.It includes three steps - <br>
         
   <ul>
    <li><b>Splitting</b></li>
    <li><b>Applying</b>
        <ul>
            <li>Aggregation</li>
            <li>Transformation</li>
            <li>Filterting</li>
        </ul>
    </li>
    <li><b>Combine</b></li>
   </ul>
        
   Groupby property is grouped the data according the column supplied to the function.In the following example
 you can see the i have grouped the dataframe df by its team.

In [1]:
import pandas as pd
import numpy as np

In [2]:
d={
    'team':["India","New zealand","Australia","India",
            "India","New zealand","Australia","India",
            "New zealand","Australia","New zealand","Australia"],
     'Run':[330,230,300,180,200,250,190,400,340,290,390,333],
     "Match":[2,4,2,1,5,6,3,2,5,3,1,1],
     "Year":['2012','2012','2012','2012','2013','2013','2013','2013','2014','2014','2014','2014']
  }
df=pd.DataFrame(d)
df

           team  Run  Match  Year
0         India  330      2  2012
1   New zealand  230      4  2012
2     Australia  300      2  2012
3         India  180      1  2012
4         India  200      5  2013
5   New zealand  250      6  2013
6     Australia  190      3  2013
7         India  400      2  2013
8   New zealand  340      5  2014
9     Australia  290      3  2014
10  New zealand  390      1  2014
11    Australia  333      1  2014

    groupby() function will return an object.we can imagine that every group is pointing to its dataframe.

In [3]:
g=df.groupby('team')

In [4]:
g.head()

           team  Run  Match  Year
0         India  330      2  2012
1   New zealand  230      4  2012
2     Australia  300      2  2012
3         India  180      1  2012
4         India  200      5  2013
5   New zealand  250      6  2013
6     Australia  190      3  2013
7         India  400      2  2013
8   New zealand  340      5  2014
9     Australia  290      3  2014
10  New zealand  390      1  2014
11    Australia  333      1  2014

In [5]:
for team,teamdata in g:
    print(team)
    print("-"*10)
    print(teamdata)
    print("-"*35)

Australia
----------
         team  Run  Match  Year
2   Australia  300      2  2012
6   Australia  190      3  2013
9   Australia  290      3  2014
11  Australia  333      1  2014
-----------------------------------
India
----------
    team  Run  Match  Year
0  India  330      2  2012
3  India  180      1  2012
4  India  200      5  2013
7  India  400      2  2013
-----------------------------------
New zealand
----------
           team  Run  Match  Year
1   New zealand  230      4  2012
5   New zealand  250      6  2013
8   New zealand  340      5  2014
10  New zealand  390      1  2014
-----------------------------------

 **get_group('group name') :**  <br>
  It will return dataframe of particular group

In [6]:
g.get_group('India')

    team  Run  Match  Year
0  India  330      2  2012
3  India  180      1  2012
4  India  200      5  2013
7  India  400      2  2013

In [7]:
g.get_group('Australia')

         team  Run  Match  Year
2   Australia  300      2  2012
6   Australia  190      3  2013
9   Australia  290      3  2014
11  Australia  333      1  2014

     We can also perform group operations as if tthe groups were dataframes:

In [8]:
g.min()

             Run  Match  Year
team
Australia    190      1  2012
India        180      1  2012
New zealand  230      1  2012

In [9]:
g.mean()

                Run  Match
team
Australia    278.25   2.25
India        277.50   2.50
New zealand  302.50   4.00

In [10]:
g_yr=df.groupby('Year')
g_yr['Run'].agg([np.min,np.max,np.mean,np.sum,np.std])

      amin  amax    mean   sum        std
Year
2012   180   330  260.00  1040  67.823300
2013   190   400  260.00  1040  96.953597
2014   290   390  338.25  1353  40.974586